src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркетинговоеМероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СоглашенияОЦенообразовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоглашенияОЦенообразовании</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИндивидуальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравилоОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаОкругления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Активное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ЦенообразованиеСервер/Ext/Module.bsl
// Область содержит экспортные методы расчёта итоговой цены реализации:
// получение базовой цены по виду цены, применение индивидуальных условий контрагента
// (если включена соответствующая функциональная опция) и применение процента скидки.
#Область ПрограммныйИнтерфейс

// Возвращает итоговую цену номенклатуры с учётом базовой цены по виду цены, индивидуальной цены контрагента
// (если включена функциональная опция УчитыватьИндивидуальныеЦены) и процента скидки, рассчитанного
// модулем РасчётСкидок. Применяется ограничение по константе МаксимальнаяСкидкаПоУмолчанию.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - позиция, для которой рассчитывается цена.
//  Контрагент   - СправочникСсылка.Партнёры - покупатель, влияет на расчёт скидки и индивидуальной цены.
//  СуммаЗаказа  - Число - сумма заказа, передаётся в расчёт скидки.
//  ВидЦены      - СправочникСсылка.ВидыЦен - вид цены для получения базовой цены.
//  Договор      - СправочникСсылка.ДоговорыКонтрагентов - договор продажи, передаётся в расчёт скидки.
//  Дата         - Дата - дата, на которую запрашивается срез цен и применяется акция.
//
// Возвращаемое значение:
//  Число - итоговая цена единицы номенклатуры со скидкой; 0, если базовая цена не найдена.
//
// Пример:
//  Цена = ЦенообразованиеСервер.ПолучитьИтоговуюЦенуСоСкидкой(
//      Номенклатура, Контрагент, СуммаЗаказа, ВидЦены, Договор, ТекущаяДатаСеанса());
//
Функция ПолучитьИтоговуюЦенуСоСкидкой(Номенклатура, Контрагент, СуммаЗаказа,
		ВидЦены, Договор, Дата) Экспорт

	БазоваяЦена = ПолучитьБазовуюЦену(Номенклатура, ВидЦены, Дата);

	Если БазоваяЦена = 0 Тогда
		Возврат 0;
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("УчитыватьИндивидуальныеЦены") Тогда
		ИндивидуальнаяЦена = ПолучитьИндивидуальнуюЦену(Контрагент, Номенклатура);
		Если ИндивидуальнаяЦена > 0 Тогда
			БазоваяЦена = ИндивидуальнаяЦена;
		КонецЕсли;
	КонецЕсли;

	ПроцентСкидки = РасчётСкидок.РассчитатьСкидку(Контрагент, Договор, СуммаЗаказа, Дата);

	ПотолокСкидки = Константы.МаксимальнаяСкидкаПоУмолчанию.Получить();
	Если ПроцентСкидки > ПотолокСкидки Тогда
		ПроцентСкидки = ПотолокСкидки;
	КонецЕсли;

	ИтоговаяЦена = БазоваяЦена * (1 - ПроцентСкидки / 100);

	Возврат ИтоговаяЦена;

КонецФункции

#КонецОбласти

// Область содержит вспомогательные функции для чтения данных подсистемы ценообразования из регистров:
// получение цены по виду цены из регистра сведений ЦеныНоменклатуры
// и получение действующей индивидуальной цены контрагента из регистра сведений СоглашенияОЦенообразовании.
#Область СлужебныеПроцедурыИФункции

// Возвращает базовую цену номенклатуры по виду цены на указанную дату из регистра сведений ЦеныНоменклатуры.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - позиция, для которой запрашивается цена.
//  ВидЦены      - СправочникСсылка.ВидыЦен - вид цены, по которому ведётся поиск.
//  Дата         - Дата - дата среза последних.
//
// Возвращаемое значение:
//  Число - значение цены или 0, если запись в регистре не найдена.
//
Функция ПолучитьБазовуюЦену(Номенклатура, ВидЦены, Дата)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата,
		|		Номенклатура = &Номенклатура
		|		И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);

	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Цена;
	КонецЕсли;

	Возврат 0;

КонецФункции

// Возвращает действующую индивидуальную цену контрагента на номенклатуру из регистра сведений
// СоглашенияОЦенообразовании по активным записям.
//
// Параметры:
//  Контрагент   - СправочникСсылка.Партнёры - покупатель, для которого ищется индивидуальная цена.
//  Номенклатура - СправочникСсылка.Номенклатура - позиция, для которой ищется индивидуальная цена.
//
// Возвращаемое значение:
//  Число - значение индивидуальной цены или 0, если активное соглашение не найдено.
//
Функция ПолучитьИндивидуальнуюЦену(Контрагент, Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СоглашенияОЦенообразовании.ИндивидуальнаяЦена КАК Цена
		|ИЗ
		|	РегистрСведений.СоглашенияОЦенообразовании КАК СоглашенияОЦенообразовании
		|ГДЕ
		|	СоглашенияОЦенообразовании.Контрагент = &Контрагент
		|	И СоглашенияОЦенообразовании.Номенклатура = &Номенклатура
		|	И СоглашенияОЦенообразовании.Активное";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Цена;
	КонецЕсли;

	Возврат 0;

КонецФункции

#КонецОбласти
